const storyData = [
  {
    "title-picture": "/source/Chapter1/Warship.png",
    chap: "第一幕",
    title: "自强学堂",
    border: "/source/Chapter1/Border.jpg",
    photos: [
      {
        id: 0,
        imgSrc: "/source/Chapter1/ZongLiYaMen.jpg",
        description:
          "1893年11月29日 ，张之洞向光绪帝上奏《设立自强学堂片》。 他认为“盖闻经国以自强为本”、“自强之道，以教育人才为先”，故取“自强”二字。",
      },
      {
        id: 1,
        imgSrc: "/source/Chapter1/PiFu.jpg",
        description: "这份报告寄达京城后，光绪皇帝在报告上朱批7个大字：该衙知道了，钦此。自此历经3年，三易其名，第一所近代新式学堂——湖北自强学堂，终告建立。",
      },
      {
        id: 2,
        imgSrc: "/source/Chapter1/JiaWu.jpg",
        description: "1896年7月 ，鉴于中日甲午战争的教训，自强学堂改订章程，调整学科门类设置，强化外语人才的培养，算学改归两湖书院。 格致、商务不再单独设门，只作为课程附列其中。",
      },
    ],
    people: [
      {
        id: 0,
        imgSrc: "/source/Chapter1/ZhangZhiDong.png",
        name: "张之洞",
        description:
          "光绪十五年（1889年）七月十二日，人称“洋务殿军”的张之洞调补湖广总督。其间，张之洞在湖北倾全力于近代工业、商业的兴办，筹办湖北织布官局、湖北枪炮厂，开采大冶、鹤峰的铜铁矿，筹建亚洲第一家大型钢铁联合企业——汉阳炼铁厂。新式工商业的发展，急需大批新式的专门人才，张之洞由此萌生了创办新式学堂——湖北自强学堂的构想。",
      },
      {
        id: 1,
        imgSrc: "/source/Chapter1/CaiXiYong.png",
        name: "蔡锡勇",
        description: "蔡锡勇(1847-1898),福建龙溪人;同治十年由张之洞派充广东洋务局总办，负责办理交涉事务，开设银元局、枪炮厂、水陆师学堂以及制造兵轮等事。十五年由张之洞调任湖北铁政局总办，先后筹办湖北炼铁厂、枪炮厂、银元局、织布局、纺纱局、缫丝局、自强学堂、武备学堂。曾取法美国凌士礼(Lindsley)一派速记术，研制中国拼音文字方案。著有《传音快字》。",
      },
      {
        id: 2,
        imgSrc: "/source/Chapter1/GuHongMing.png",
        name: "辜鸿铭",
        description: "辜鸿铭生于南洋英属马来西亚槟榔屿。学博中西，号称“清末怪杰”。他翻译了中国“四书”中的三部——《论语》《中庸》和《大学》，创获甚巨；并著有《中国的牛津运动》（原名《清流传》）和《中国人的精神》（原名《春秋大义》）等英文书，热衷向西方人宣传东方的文化和精神，并产生了重大的影响。自强学堂正式成立后，蔡锡勇受命担任总办（校长），辜鸿铭任方言教习，成为自强学堂一代名师。",
      },
      {
        id: 3,
        imgSrc: "/source/Chapter1/HuaHengFang.png",
        name: "华蘅芳",
        description: "华蘅芳（1833—1902年），字若汀，江苏无锡县荡口镇(今江苏省无锡市锡山区鹅湖镇)人。中国清末数学家、科学家、翻译家和教育家，中国近代科学的先驱。他曾三次被奏保举，受到洋务派器重，一生与洋务运动关系密切，成为这个时期有代表性的科学家之一。还提出了二十多种对于勾股定理证法。1892年，到武昌的两湖书院、自强学堂讲授数学，写出《求乘数法》、《数根 演古》、《循环小数考》等书。",
      }
    ],
  },
  {
    "title-picture": "/source/Chapter2/JetZero.jpg",
    chap: "第二幕",
    title: "西迁乐山",
    border: "/source/Chapter1/Border.jpg",
    photos: [
      {
        id: 0,
        imgSrc: "/source/Chapter2/Story2.jpg",
        description:
          "1931年九一八事变后，日军侵华野心昭然若揭。1937年，南京沦陷，地处于全国中心腹地的武汉岌岌可危。为躲避战火，保护师生安全，武汉大学决定放弃刚刚落成的新校址，进行西迁。",
      },
      {
        id: 1,
        imgSrc: "/source/Chapter2/Story1.jpg",
        description: "1938年初，武大委派法学院院长杨端六和工学院院长邵逸周两位先期前往四川考察迁校地址。多次派员实地考察后，武大决定迁往四川乐山。顺着长江溯流而上，来到乐山。在黑白照片上的人都只有二十来岁，气质儒雅、斯文。他们便是夭亡在乐山的部分武大学生。",
      },
      {
        id: 2,
        imgSrc: "/source/Chapter2/Story3.jpg",
        description: "在国难当头的岁月，他们像苏步青号召的那样“读书不忘报国，报国不忘读书”。青葱般的年龄，他们却成为客死异乡的孤魂。或许，如果后人还记得他们，还记得有一所在烽火中化蛹为蝶的大学，他们就会魂兮归来。",
      },
    ],
    people: [
      {
        id: 0,
        imgSrc: "/source/Chapter2/WangXingGong.jpg",
        name: "王星拱",
        description: "与王世杰、李四光等一起负责筹建国立武汉大学，任国立武汉大学化学系首任系主任。1933年5月出任国立武汉大学校长，后因得罪战时教育部长陈立夫，1945年7月，王星拱调任中山大学校长。1948年3月，他辞职回到安庆。其间，国民党当局屡次催逼他飞赴台湾，他都不予理睬。1949年10月8日，王星拱在上海病逝，终年61岁。",
      },
      {
        id: 1,
        imgSrc: "/source/Chapter2/YeQiao.jpg",
        name: "叶峤",
        description: "1935年起任武汉大学化学系教授。历任武汉大学理学院院长、化学系主任、有机化学教研室主任等职。发表《有机化合物构造式其药性之关系》、《毒气战争与团体防御》等著述。在理论有机化学、天然有机化学、中草药化学等领域有很深的造诣，在学术界享有盛誉。",
      },
      {
        id: 2,
        imgSrc: "/source/Chapter2/ZhuDongRun.jpg",
        name: "朱东润",
        description: "民国三年留学英国伦敦西南学院。民国五年初，朱东润先生为参加反袁复辟斗争而毅然回国。1917年秋至广西省立第二中学任教。1919年任南通师范学校教师。1929年出任武汉大学特约讲师，受闻一多先生委托首次开设中国文学批评史课程。",
      },
      {
        id: 3,
        imgSrc: "/source/Chapter2/ZhuGuangQian.jpg",
        name: "朱光潜",
        description: "民国十一年（1922年）毕业于香港大学文学院。民国十四年（1925年）留学英国爱丁堡大学，致力于文学、心理学与哲学的学习与研究，后在法国斯特拉斯堡大学获哲学博士学位。民国二十二年（1933年）回国后，历任北京大学、四川大学、武汉大学教授。民国三十五年（1946年）后一直在北京大学任教，讲授美学与西方文学。",
      }
    ],
  },
  {
    "title-picture": "/source/Chapter3/WHU.jpg",
    chap: "第三幕",
    title: "巍巍武大",
    border: "/source/Chapter1/Border.jpg",
    photos: [
      {
        id: 0,
        imgSrc: "/source/Chapter3/Story1.jpg",
        description: "1958年9月12日下午7时20分，毛泽东在湖北省委负责人和武汉大学党政领导的陪同下，莅临武汉大学视察。毛泽东视察了化学系和物理系的校办工厂，参观了师生员工创办的炼焦厂、空气电池厂、硫酸厂、硅胶厂、卡普隆厂等。",
      },
      {
        id: 1,
        imgSrc: "/source/Chapter3/Story2.jpg",
        description: "十年浩劫后，1981年国务院最后确定并公布了武大第一批博导。他们是现代外国哲学江天骥，世界经济吴纪先，国际法韩德培，汉语史黄焯，中国古代史唐长孺，世界近现代史吴于廑，基础数学齐民友、李国平、余家荣、路可见，空间物理梁百先，物理化学查全性，植物学孙祥钟，病毒学高尚荫等教授。",
      },
      {
        id: 2,
        imgSrc: "/source/Chapter3/Story3.jpg",
        description: "“珞珈之山，东湖之水，山高水长，流风甚美”。跨越三个世纪的武汉大学迎来她的130周年华诞。一百三十载栉风沐雨、峥嵘岁月；一百三十载砥砺奋进、勇毅前行。",
      },
    ],
    people: [
      {
        id: 0,
        imgSrc: "/source/Chapter3/LiuDaoYu.png",
        name: "刘道玉",
        description:
          "刘道玉是中国教育改革的杰出代表，他对中国教育创新做出了不可磨灭的贡献，在1981年—1988年担任武汉大学校长期间，倡导自由民主的校园文化，推动学分制、主辅修制、插班生制、导师制、贷学金制、学术假制等改革，领风气之先，拉开了中国高教改革的序幕，被誉为“武大的蔡元培”。",
      },
      {
        id: 1,
        imgSrc: "/source/Chapter3/LiXiaoHong.png",
        name: "李晓红",
        description: "李晓红认为，必须全面实施素质教育，着力提高教育质量，始终坚持内涵发展、创新发展、特色发展、国际化发展，营造独立思考、自由探索、勇于创新的良好环境，培养学生创新精神，培养具有国际竞争力的拔尖创新人才。李晓红在武汉大学2011年工作研讨会上指出，武汉大学应该办成一所“顶天立地”的大学。“顶天”，就是要办“中国特色、世界一流、国际知名高水平大学”。“立地”，就是要扎根湖北，面向全国，服务国家，为地方经济建设与社会发展提供支撑。",
      },
      {
        id: 2,
        imgSrc: "/source/Chapter3/DouXianKang.png",
        name: "窦贤康",
        description: "2016年窦贤康担任武汉大学校长后，提出了这样的人才工作理念：变被动为主动，把“凤凰”引来后，为他们量身打造适合他们科研教学需要的平台，把武汉大学打造成高端人才聚集地。2017年，学校定位为“人才强校年”，加大宣传力度、海外招聘、举办国际交叉学科论坛、搭建高端科研平台、健全育才体系",
      }
    ],
  },
];

export function getData(storyId) {
  return storyData[storyId];
}
